[
    {
        "from": "2014",
        "to": "On Hold",
        "name": "Instituto Politécnico de Leiria - Escola Superior Tecnologia e Gestão",
        "nameDescription": "",
        "webpage": "https://www.ipleiria.pt/estg/",
        "country": "Portugal",
        "title": "BSc in Computer Engineering - Information Systems",
        "description": "BSc in Computer Engineering, aims to familiarise the student with the technical, industry and scientific ways of thinking. The course also aims to provide students with professional skills for information systems planning, analysis, specification and development, as well operational skills on networked information systems setup and administration, specialized ad-hoc computational-based solutions development, project supervision and teaching of informatics engineering and computer science topics.<br><br>The skills acquainted along the course allow the Computer Engineering professionals to effectively develop industry based tasks and professions, as well to develop research activities in the context of further MSc or PhD studies.<br><br>Besides providing strong technical knowledge, the course also aims to boost the students' skills for self-learning, so that they can constantly update their technical knowledge and thus adapt themselves to the innovations and changes of a fast-paced evolving world.<br<br>In addition to technical and personal communication skills, the course also aims to foster the so-called soft skills, like the ethical and human factors which are of particular importance in the successful integration of a professional in multidisciplinary projects."
    },
    {
        "from": "2004",
        "to": "2010",
        "name": "Instituto Politécnico de Leiria - Escola Superior Tecnologia e Gestão",
        "nameDescription": "",
        "webpage": "https://www.ipleiria.pt/en/course/master-in-computer-engineering-mobile-computing/?force-lang",
        "country": "Portugal",
        "title": "Masters Computer Engineering – Mobile Computing",
        "description": "To confer a professional specialization with great emphasis on mobile computing and related technologies, allowing a series of studies to the holders of a degree in Computer Engineering, and related courses, including the possibility of expertise to professionals in the labour market.<br><br>The graduate students of the study cycle should be able to:<ul><li>Apply the knowledge and the ability to understand and solve problems in new and unfamiliar situations, and in broad and multidisciplinary contexts;</li><li>Integrate knowledge, handle complex issues, develop solutions and make judgments in situations of limited or incomplete information;</li><li>Communicate the conclusions achieved and the knowledge acquired, both to specialists and non-specialist in the field of Mobile Computing;</li><li>Develop skills that allow a life-long learning fundamentally in a self-oriented or independent way.</li></ul>"
    }
]